app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 24 Aug 2013 12:39:30 UTC +00:00], ["text", "444"], ["title", "44"], ["updated_at", Sat, 24 Aug 2013 12:39:30 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post].permit(:title, :text))

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'First post', "text" = 'I''m trying to make it a long one.', "updated_at" = '2013-08-25 13:30:17.250390' WHERE "posts"."id" = 2
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post].permit(:title, :text))